In [1]:
import pandas as pd

In [3]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [4]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
# if only want to read 2 columns, set parameter usecols
ufo = pd.read_csv('http://bit.ly/uforeports', usecols=['City', 'State'])
ufo.columns

Index(['City', 'State'], dtype='object')

In [10]:
# can use reference for usecols parameter
ufo = pd.read_csv('http://bit.ly/uforeports', usecols=[0,4])
ufo.columns

Index(['City', 'Time'], dtype='object')

In [13]:
# if only want to read certain no of rows
ufo = pd.read_csv('http://bit.ly/uforeports', nrows=10)
ufo

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
5,Valley City,NaN,DISK,ND,9/15/1934 15:30
6,Crater Lake,NaN,CIRCLE,CA,6/15/1935 0:00
7,Alma,NaN,DISK,MI,7/15/1936 0:00
8,Eklutna,NaN,CIGAR,AK,10/15/1936 17:00
9,Hubbard,NaN,CYLINDER,OR,6/15/1937 0:00

In [14]:
for c in ufo.City:
    print(c)

Ithaca
Willingboro
Holyoke
Abilene
New York Worlds Fair
Valley City
Crater Lake
Alma
Eklutna
Hubbard

In [19]:
ufo.iterrows()

In [21]:
# iteration by row, iterrows() method
for index, row in ufo.iterrows():
    print(index, row.City, row.State, row['Colors Reported'])

0 Ithaca NY nan
1 Willingboro NJ nan
2 Holyoke CO nan
3 Abilene KS nan
4 New York Worlds Fair NY nan
5 Valley City ND nan
6 Crater Lake CA nan
7 Alma MI nan
8 Eklutna AK nan
9 Hubbard OR nan

In [22]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [23]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [26]:
# to only select numeric column(s) from a DataFrame
import numpy as np
drinks.select_dtypes(include=[np.number])

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,0,0,0,0.0
1,89,132,54,4.9
2,25,0,14,0.7
3,245,138,312,12.4
4,217,57,45,5.9
...,...,...,...,...
188,333,100,3,7.7
189,111,2,1,2.0
190,6,0,0,0.1
191,32,19,4,2.5
192,64,18,4,4.7

In [27]:
drinks.select_dtypes(include=[np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [30]:
# to display only certain data type(s), use include=[]
drinks.describe(include=['object', 'float64'])

          country  total_litres_of_pure_alcohol continent
count         193                    193.000000       193
unique        193                           NaN         6
top     Indonesia                           NaN    Africa
freq            1                           NaN        53
mean          NaN                      4.717098       NaN
std           NaN                      3.773298       NaN
min           NaN                      0.000000       NaN
25%           NaN                      1.300000       NaN
50%           NaN                      4.200000       NaN
75%           NaN                      7.200000       NaN
max           NaN                     14.400000       NaN